app/controllers/application_controller.rb

def categories_load
    @lescategories = Categorie.first(3)
    #on charge une variable avec les 3 categorie qui apparaitrons dans la nav barre
    @toutescategories = Categorie.all
    #la on charge une variable pour le menu deroulant de la nav bar, qui affichera toutes les categories.

    @visites10 = Product.first(10)
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT $1  [["LIMIT", 3]]
SELECT "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT $1  [["LIMIT", 10]]