app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings" LIMIT $1 OFFSET $2  [["LIMIT", 12], ["OFFSET", 0]]
SELECT COUNT(*) FROM "bookings"
---
def index
  @bookings = Booking.page(params[:page]).per(12)

DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 42]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
---
def destroy
    Booking.find(params[:id]).destroy

SELECT "bookings".* FROM "bookings" ORDER BY "bookings"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 1]]
---
def booking_by_users
  @resa = Booking.all
  @booking_by_user = @resa.where(user: current_user.id)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
INSERT INTO "bookings" ("comment", "participants", "created_at", "updated_at", "user_id", "date", "product_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["comment", "essaie"], ["participants", 2], ["created_at", "2020-01-20 23:53:17.700434"], ["updated_at", "2020-01-20 23:53:17.700434"], ["user_id", 1], ["date", "2020-01-22"], ["product_id", 20]]
---
def create
    @booking = Booking.new(booking_params)
    # we need `restaurant_id` to associate review with corresponding restaurant
    @product = Product.find(params[:product_id])
    @booking.product = @product
    @booking.user = current_user
    @booking.save

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
UPDATE "bookings" SET "status" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["status", 1], ["updated_at", "2020-02-01 12:37:32.442920"], ["id", 63]]
---
def update
    Booking.find(params[:id]).update  status: params[:status]