app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("comment", "participants", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "fff"], ["participants", 2], ["created_at", "2020-01-18 19:33:55.975651"], ["updated_at", "2020-01-18 19:33:55.975651"], ["status", 1]]
---
def create
    Booking.create comment: params[:comment], participants: params[:participants], status: params[:status], date: params[:date], user: current_user

UPDATE "bookings" SET "status" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["status", 2], ["updated_at", "2020-01-18 20:08:43.121074"], ["id", 9]]
---
def update
    Booking.find(params[:id]).update  status: params[:status]