app/controllers/contacts_controller.rb

  def create
    @user = current_user
  @contact = Contact.create contenu: params[:contenu], sujet: params[:sujet], mail: params[:mail], user_id: @user.id
---
INSERT INTO "contacts" ("sujet", "contenu", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sujet", "essaie avec user"], ["contenu", "essaie avec user auto"], ["created_at", "2020-01-25 00:35:47.734018"], ["updated_at", "2020-01-25 00:35:47.734018"], ["user_id", 6]]