app/controllers/orders_controller.rb

INSERT INTO "orders" ("state", "user_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["state", "pending"], ["user_id", 1], ["cart_id", 1], ["created_at", "2019-10-11 12:29:26.829279"], ["updated_at", "2019-10-11 12:29:26.829279"]]
---
def create
  booking = Booking.find(params[:booking_id])
  order  = Order.create!(booking: booking, booking_sku: booking.sku, amount: booking.price, state: 'pending', user: current_user)