app/controllers/products_controller.rb

  def create
    #@categories = Categorie.all
     @product = Product.create(product_params)
      if @product.save
---
UPDATE "products" SET "photo" = $1 WHERE "products"."id" = $2  [["photo", "image/upload/v1580769553/im8kn99pnr8qyhyut0w8.jpg"], ["id", 30]]