app/controllers/products_controller.rb

  def create
    #@categories = Categorie.all
    product = Product.create(product_params)
---
INSERT INTO "products" ("title", "subtitle", "description", "categorie_id", "zone_id", "price_cents") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "bloooo"], ["subtitle", "bloooo"], ["description", "blooo"], ["categorie_id", 1], ["zone_id", 1], ["price_cents", 500]]

  def update
    @product = Product.find(params[:id])
    Product.find(params[:id]).update title: params[:title], subtitle: params[:subtitle], description: params[:description], price: params[:price], categorie_id: params[:categorie_id], zone_id: params[:zone_id], photo: params[:photo]
---
UPDATE "products" SET "photo" = $1 WHERE "products"."id" = $2  [["photo", "image/upload/v1580769553/im8kn99pnr8qyhyut0w8.jpg"], ["id", 30]]