app/controllers/products_controller.rb

SELECT "products".* FROM "products" LIMIT $1 OFFSET $2  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
  def index
    @les_produits = Product.page(params[:page]).per(8)

SELECT "products".* FROM "products"
---
  def index_admin
    @les_produits = Product.all

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
SELECT "products".* FROM "products" WHERE "products"."categorie_id" = $1 LIMIT $2 OFFSET $3  [["categorie_id", 1], ["LIMIT", 4], ["OFFSET", 0]]
---
  def show

    @booking = Booking.new
    @product = Product.find(params[:id])
    @products =Product.categorie_id(@product.categorie.id).page(params[:page]).per(4)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
  def show_admin
     @product = Product.find(params[:id])
    @products =Product.categorie_id(@product.categorie.id).page(params[:page]).per(4)

SELECT "categories".* FROM "categories"
SELECT "products".* FROM "products" WHERE "products"."categorie_id" = $1 LIMIT $2 OFFSET $3  [["categorie_id", 1], ["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE "products"."categorie_id" = $1  [["categorie_id", 1]]
---
  def index_by_categorie
    @productby = Product.categorie_id(params[:id]).page(params[:page]).per(8)

SELECT "categories".* FROM "categories"
SELECT "zones".* FROM "zones"
---
  def new
   @product = Product.new
   @categories = Categorie.all
   @zones = Zone.all

INSERT INTO "products" ("title", "subtitle", "description", "categorie_id", "zone_id", "photo", "price_cents") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "testphoto3"], ["subtitle", "testphoto3"], ["description", "testphoto3"], ["categorie_id", 1], ["zone_id", 1], ["photo", "im8kn99pnr8qyhyut0w8.jpg"], ["price_cents", 200]]
---
  def create
    #@categories = Categorie.all
    product = Product.create(product_params)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "products" SET "title" = $1 WHERE "products"."id" = $2  [["title", "testphoto12"], ["id", 30]]
---
  def update
    @product = Product.find(params[:id])
    Product.find(params[:id]).update title: params[:title], subtitle: params[:subtitle], description: params[:description], price: params[:price], categorie_id: params[:categorie_id], zone_id: params[:zone_id], photo: params[:photo]

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 29]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def destroy
    Product.find(params[:id]).destroy